remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/uart.h
/**
 * \file
 *
 * \brief Component description for UART
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_UART_COMPONENT_
#define _SAMB11_UART_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR UART */
/* ========================================================================== */
/** \addtogroup SAMB11_UART UART Controller 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define UART_U1234
#define REV_UART                         0x100

/* -------- UART_TRANSMIT_DATA : (UART Offset: 0x00) (/W 8) Writes one byte to UART Transmit Data FIFO.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TX_BYTE:8;                 /**< bit:   0..7  Writes data in transmit FIFO. If byte length is set to 7, the MSB should be set to 0.  */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} UART_TRANSMIT_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_TRANSMIT_DATA_OFFSET           0x00                                          /**<  (UART_TRANSMIT_DATA) Writes one byte to UART Transmit Data FIFO.   Offset */
#define UART_TRANSMIT_DATA_RESETVALUE       0x00u                                         /**<  (UART_TRANSMIT_DATA) Writes one byte to UART Transmit Data FIFO.   Reset Value */

#define UART_TRANSMIT_DATA_TX_BYTE_Pos      0                                              /**< (UART_TRANSMIT_DATA) Writes data in transmit FIFO. If byte length is set to 7, the MSB should be set to 0.  Position */
#define UART_TRANSMIT_DATA_TX_BYTE_Msk      (0xFFu << UART_TRANSMIT_DATA_TX_BYTE_Pos)      /**< (UART_TRANSMIT_DATA) Writes data in transmit FIFO. If byte length is set to 7, the MSB should be set to 0.  Mask */
#define UART_TRANSMIT_DATA_TX_BYTE(value)   (UART_TRANSMIT_DATA_TX_BYTE_Msk & ((value) << UART_TRANSMIT_DATA_TX_BYTE_Pos))
#define UART_TRANSMIT_DATA_MASK             0xFFu                                          /**< \deprecated (UART_TRANSMIT_DATA) Register MASK  (Use UART_TRANSMIT_DATA_Msk instead)  */
#define UART_TRANSMIT_DATA_Msk              0xFFu                                          /**< (UART_TRANSMIT_DATA) Register Mask  */

/* -------- UART_TRANSMIT_STATUS : (UART Offset: 0x04) (R/ 8) Status of the UART transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TX_FIFO_NOT_FULL:1;        /**< bit:      0  Active High indication when Tx FIFO can still accepts at least one more character. 0: TX FIFO Full. 1: TX FIFO not Full.  */
    uint8_t  TX_FIFO_0P25_EMPTY:1;      /**< bit:      1  Active High indication when Tx FIFO is at least quarter empty. Reset when more.  */
    uint8_t  TX_FIFO_0P5_EMPTY:1;       /**< bit:      2  Active High indication when Tx FIFO is at least half empty. Reset when more.  */
    uint8_t  TX_FIFO_0P75_EMPTY:1;      /**< bit:      3  Active High indication when Tx FIFO is at least three quarters empty. Reset when more.  */
    uint8_t  TX_FIFO_EMPTY:1;           /**< bit:      4  Active High indication when Tx FIFO is Empty and has no more character to transmit  */
    uint8_t  CTS_ACTIVE:1;              /**< bit:      5  Active High indication when flow control signal "cts" is active. Unaffected by cts  enable bit in config register.  */
    uint8_t  :2;                        /**< bit:   6..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} UART_TRANSMIT_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_TRANSMIT_STATUS_OFFSET         0x04                                          /**<  (UART_TRANSMIT_STATUS) Status of the UART transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.   Offset */
#define UART_TRANSMIT_STATUS_RESETVALUE     0x00u                                         /**<  (UART_TRANSMIT_STATUS) Status of the UART transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.   Reset Value */

#define UART_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos 0                                              /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO can still accepts at least one more character. 0: TX FIFO Full. 1: TX FIFO not Full.  Position */
#define UART_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Msk (0x1u << UART_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos)  /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO can still accepts at least one more character. 0: TX FIFO Full. 1: TX FIFO not Full.  Mask */
#define UART_TRANSMIT_STATUS_TX_FIFO_NOT_FULL UART_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Msk instead */
#define UART_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Pos 1                                              /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least quarter empty. Reset when more.  Position */
#define UART_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Msk (0x1u << UART_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Pos)  /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least quarter empty. Reset when more.  Mask */
#define UART_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY UART_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Msk instead */
#define UART_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Pos 2                                              /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least half empty. Reset when more.  Position */
#define UART_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Msk (0x1u << UART_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Pos)  /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least half empty. Reset when more.  Mask */
#define UART_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY UART_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Msk instead */
#define UART_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Pos 3                                              /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least three quarters empty. Reset when more.  Position */
#define UART_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Msk (0x1u << UART_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Pos)  /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least three quarters empty. Reset when more.  Mask */
#define UART_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY UART_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Msk instead */
#define UART_TRANSMIT_STATUS_TX_FIFO_EMPTY_Pos 4                                              /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO is Empty and has no more character to transmit  Position */
#define UART_TRANSMIT_STATUS_TX_FIFO_EMPTY_Msk (0x1u << UART_TRANSMIT_STATUS_TX_FIFO_EMPTY_Pos)  /**< (UART_TRANSMIT_STATUS) Active High indication when Tx FIFO is Empty and has no more character to transmit  Mask */
#define UART_TRANSMIT_STATUS_TX_FIFO_EMPTY  UART_TRANSMIT_STATUS_TX_FIFO_EMPTY_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TRANSMIT_STATUS_TX_FIFO_EMPTY_Msk instead */
#define UART_TRANSMIT_STATUS_CTS_ACTIVE_Pos 5                                              /**< (UART_TRANSMIT_STATUS) Active High indication when flow control signal "cts" is active. Unaffected by cts  enable bit in config register.  Position */
#define UART_TRANSMIT_STATUS_CTS_ACTIVE_Msk (0x1u << UART_TRANSMIT_STATUS_CTS_ACTIVE_Pos)  /**< (UART_TRANSMIT_STATUS) Active High indication when flow control signal "cts" is active. Unaffected by cts  enable bit in config register.  Mask */
#define UART_TRANSMIT_STATUS_CTS_ACTIVE     UART_TRANSMIT_STATUS_CTS_ACTIVE_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TRANSMIT_STATUS_CTS_ACTIVE_Msk instead */
#define UART_TRANSMIT_STATUS_MASK           0x3Fu                                          /**< \deprecated (UART_TRANSMIT_STATUS) Register MASK  (Use UART_TRANSMIT_STATUS_Msk instead)  */
#define UART_TRANSMIT_STATUS_Msk            0x3Fu                                          /**< (UART_TRANSMIT_STATUS) Register Mask  */

/* -------- UART_TX_INTERRUPT_MASK : (UART Offset: 0x08) (R/W 8) Enable or Disable the generation of interrupts by the tx_status register.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TX_FIFO_NOT_FULL_MASK:1;   /**< bit:      0  Active High Enable of tx_fifo_not_full interrupt  */
    uint8_t  TX_FIFO_0P25_EMPTY_MASK:1;  /**< bit:      1  Active High Enable of tx_fifo_0p25_empty interrupt  */
    uint8_t  TX_FIFO_0P5_EMPTY_MASK:1;  /**< bit:      2  Active High Enable of tx_fifo_0p5_empty interrupt  */
    uint8_t  TX_FIFO_0P75_EMPTY_MASK:1;  /**< bit:      3  Active High Enable of tx_fifo_0p75_empty interrupt  */
    uint8_t  TX_FIFO_EMPTY_MASK:1;      /**< bit:      4  Active High Enable of tx_fifo_empty interrupt  */
    uint8_t  CTS_ACTIVE_MASK:1;         /**< bit:      5  Active High Enable of cts_active interrupt  */
    uint8_t  :2;                        /**< bit:   6..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} UART_TX_INTERRUPT_MASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_TX_INTERRUPT_MASK_OFFSET       0x08                                          /**<  (UART_TX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the tx_status register.   Offset */
#define UART_TX_INTERRUPT_MASK_RESETVALUE   0x00u                                         /**<  (UART_TX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the tx_status register.   Reset Value */

#define UART_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Pos 0                                              /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_not_full interrupt  Position */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Msk (0x1u << UART_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Pos)  /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_not_full interrupt  Mask */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK UART_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Msk instead */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Pos 1                                              /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p25_empty interrupt  Position */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Msk (0x1u << UART_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Pos)  /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p25_empty interrupt  Mask */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK UART_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Msk instead */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Pos 2                                              /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p5_empty interrupt  Position */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Msk (0x1u << UART_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Pos)  /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p5_empty interrupt  Mask */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK UART_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Msk instead */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Pos 3                                              /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p75_empty interrupt  Position */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Msk (0x1u << UART_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Pos)  /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p75_empty interrupt  Mask */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK UART_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Msk instead */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Pos 4                                              /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_empty interrupt  Position */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Msk (0x1u << UART_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Pos)  /**< (UART_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_empty interrupt  Mask */
#define UART_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK UART_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Msk instead */
#define UART_TX_INTERRUPT_MASK_CTS_ACTIVE_MASK_Pos 5                                              /**< (UART_TX_INTERRUPT_MASK) Active High Enable of cts_active interrupt  Position */
#define UART_TX_INTERRUPT_MASK_CTS_ACTIVE_MASK_Msk (0x1u << UART_TX_INTERRUPT_MASK_CTS_ACTIVE_MASK_Pos)  /**< (UART_TX_INTERRUPT_MASK) Active High Enable of cts_active interrupt  Mask */
#define UART_TX_INTERRUPT_MASK_CTS_ACTIVE_MASK UART_TX_INTERRUPT_MASK_CTS_ACTIVE_MASK_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_TX_INTERRUPT_MASK_CTS_ACTIVE_MASK_Msk instead */
#define UART_TX_INTERRUPT_MASK_Msk          0x3Fu                                          /**< (UART_TX_INTERRUPT_MASK) Register Mask  */

/* -------- UART_RECEIVE_DATA : (UART Offset: 0x10) (R/ 8) Read one byte from UART Receive Data FIFO.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RX_BYTE:8;                 /**< bit:   0..7  Oldest data in receive FIFO. If byte length is set to 7, the MSB is set to 0.  */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} UART_RECEIVE_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_RECEIVE_DATA_OFFSET            0x10                                          /**<  (UART_RECEIVE_DATA) Read one byte from UART Receive Data FIFO.   Offset */
#define UART_RECEIVE_DATA_RESETVALUE        0x00u                                         /**<  (UART_RECEIVE_DATA) Read one byte from UART Receive Data FIFO.   Reset Value */

#define UART_RECEIVE_DATA_RX_BYTE_Pos       0                                              /**< (UART_RECEIVE_DATA) Oldest data in receive FIFO. If byte length is set to 7, the MSB is set to 0.  Position */
#define UART_RECEIVE_DATA_RX_BYTE_Msk       (0xFFu << UART_RECEIVE_DATA_RX_BYTE_Pos)       /**< (UART_RECEIVE_DATA) Oldest data in receive FIFO. If byte length is set to 7, the MSB is set to 0.  Mask */
#define UART_RECEIVE_DATA_RX_BYTE(value)    (UART_RECEIVE_DATA_RX_BYTE_Msk & ((value) << UART_RECEIVE_DATA_RX_BYTE_Pos))
#define UART_RECEIVE_DATA_MASK              0xFFu                                          /**< \deprecated (UART_RECEIVE_DATA) Register MASK  (Use UART_RECEIVE_DATA_Msk instead)  */
#define UART_RECEIVE_DATA_Msk               0xFFu                                          /**< (UART_RECEIVE_DATA) Register Mask  */

/* -------- UART_RECEIVE_STATUS : (UART Offset: 0x14) (R/ 8) Status of the UART receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RX_FIFO_NOT_EMPTY:1;       /**< bit:      0  Active High indication when data is available in Rx FIFO. 0: RX FIFO Empty. 1: RX FIFO contains at least one byte of data.  */
    uint8_t  RX_FIFO_0P25_FULL:1;       /**< bit:      1  Active High indication when FIFO is at least quarter full. Reset when less.  */
    uint8_t  RX_FIFO_0P5_FULL:1;        /**< bit:      2  Active High indication when FIFO is at least half full. Reset when less.  */
    uint8_t  RX_FIFO_0P75_FULL:1;       /**< bit:      3  Active High indication when FIFO is at least three quarters full. Reset when less.  */
    uint8_t  TIMEOUT:1;                 /**< bit:      4  Active High indication when the timeout set in the rx_timeout register has elapsed since  the last interaction with the receiver. Reset by reading the status register.   */
    uint8_t  PARITY_ERROR:1;            /**< bit:      5  Active High indication when a receive parity error is detected. Reset by reading the status register.  */
    uint8_t  FIFO_OVERRUN:1;            /**< bit:      6  Active High indication when character is received but FIFO is full. Reset by reading the status register.  */
    uint8_t  FRAMING_ERROR:1;           /**< bit:      7  Active High indication when no stop bit is detected. Reset by reading the status register.  */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} UART_RECEIVE_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_RECEIVE_STATUS_OFFSET          0x14                                          /**<  (UART_RECEIVE_STATUS) Status of the UART receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.   Offset */
#define UART_RECEIVE_STATUS_RESETVALUE      0x00u                                         /**<  (UART_RECEIVE_STATUS) Status of the UART receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.   Reset Value */

