remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/uart.h
#define UART_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Pos 0                                              /**< (UART_RECEIVE_STATUS) Active High indication when data is available in Rx FIFO. 0: RX FIFO Empty. 1: RX FIFO contains at least one byte of data.  Position */
#define UART_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Msk (0x1u << UART_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Pos)  /**< (UART_RECEIVE_STATUS) Active High indication when data is available in Rx FIFO. 0: RX FIFO Empty. 1: RX FIFO contains at least one byte of data.  Mask */
#define UART_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY UART_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Msk instead */
#define UART_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Pos 1                                              /**< (UART_RECEIVE_STATUS) Active High indication when FIFO is at least quarter full. Reset when less.  Position */
#define UART_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Msk (0x1u << UART_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Pos)  /**< (UART_RECEIVE_STATUS) Active High indication when FIFO is at least quarter full. Reset when less.  Mask */
#define UART_RECEIVE_STATUS_RX_FIFO_0P25_FULL UART_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Msk instead */
#define UART_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Pos 2                                              /**< (UART_RECEIVE_STATUS) Active High indication when FIFO is at least half full. Reset when less.  Position */
#define UART_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Msk (0x1u << UART_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Pos)  /**< (UART_RECEIVE_STATUS) Active High indication when FIFO is at least half full. Reset when less.  Mask */
#define UART_RECEIVE_STATUS_RX_FIFO_0P5_FULL UART_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Msk instead */
#define UART_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Pos 3                                              /**< (UART_RECEIVE_STATUS) Active High indication when FIFO is at least three quarters full. Reset when less.  Position */
#define UART_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Msk (0x1u << UART_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Pos)  /**< (UART_RECEIVE_STATUS) Active High indication when FIFO is at least three quarters full. Reset when less.  Mask */
#define UART_RECEIVE_STATUS_RX_FIFO_0P75_FULL UART_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Msk instead */
#define UART_RECEIVE_STATUS_TIMEOUT_Pos     4                                              /**< (UART_RECEIVE_STATUS) Active High indication when the timeout set in the rx_timeout register has elapsed since  the last interaction with the receiver. Reset by reading the status register.   Position */
#define UART_RECEIVE_STATUS_TIMEOUT_Msk     (0x1u << UART_RECEIVE_STATUS_TIMEOUT_Pos)      /**< (UART_RECEIVE_STATUS) Active High indication when the timeout set in the rx_timeout register has elapsed since  the last interaction with the receiver. Reset by reading the status register.   Mask */
#define UART_RECEIVE_STATUS_TIMEOUT         UART_RECEIVE_STATUS_TIMEOUT_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RECEIVE_STATUS_TIMEOUT_Msk instead */
#define UART_RECEIVE_STATUS_PARITY_ERROR_Pos 5                                              /**< (UART_RECEIVE_STATUS) Active High indication when a receive parity error is detected. Reset by reading the status register.  Position */
#define UART_RECEIVE_STATUS_PARITY_ERROR_Msk (0x1u << UART_RECEIVE_STATUS_PARITY_ERROR_Pos)  /**< (UART_RECEIVE_STATUS) Active High indication when a receive parity error is detected. Reset by reading the status register.  Mask */
#define UART_RECEIVE_STATUS_PARITY_ERROR    UART_RECEIVE_STATUS_PARITY_ERROR_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RECEIVE_STATUS_PARITY_ERROR_Msk instead */
#define UART_RECEIVE_STATUS_FIFO_OVERRUN_Pos 6                                              /**< (UART_RECEIVE_STATUS) Active High indication when character is received but FIFO is full. Reset by reading the status register.  Position */
#define UART_RECEIVE_STATUS_FIFO_OVERRUN_Msk (0x1u << UART_RECEIVE_STATUS_FIFO_OVERRUN_Pos)  /**< (UART_RECEIVE_STATUS) Active High indication when character is received but FIFO is full. Reset by reading the status register.  Mask */
#define UART_RECEIVE_STATUS_FIFO_OVERRUN    UART_RECEIVE_STATUS_FIFO_OVERRUN_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RECEIVE_STATUS_FIFO_OVERRUN_Msk instead */
#define UART_RECEIVE_STATUS_FRAMING_ERROR_Pos 7                                              /**< (UART_RECEIVE_STATUS) Active High indication when no stop bit is detected. Reset by reading the status register.  Position */
#define UART_RECEIVE_STATUS_FRAMING_ERROR_Msk (0x1u << UART_RECEIVE_STATUS_FRAMING_ERROR_Pos)  /**< (UART_RECEIVE_STATUS) Active High indication when no stop bit is detected. Reset by reading the status register.  Mask */
#define UART_RECEIVE_STATUS_FRAMING_ERROR   UART_RECEIVE_STATUS_FRAMING_ERROR_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RECEIVE_STATUS_FRAMING_ERROR_Msk instead */
#define UART_RECEIVE_STATUS_MASK            0xFFu                                          /**< \deprecated (UART_RECEIVE_STATUS) Register MASK  (Use UART_RECEIVE_STATUS_Msk instead)  */
#define UART_RECEIVE_STATUS_Msk             0xFFu                                          /**< (UART_RECEIVE_STATUS) Register Mask  */

/* -------- UART_RX_INTERRUPT_MASK : (UART Offset: 0x18) (R/W 8) Enable or Disable the generation of interrupts by the rx_status register.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RX_FIFO_NOT_EMPTY_MASK:1;  /**< bit:      0  Active High Enable of rx_fifo_not_empty interrupt  */
    uint8_t  RX_FIFO_0P25_FULL_MASK:1;  /**< bit:      1  Active High Enable of rx_fifo_0p25_full interrupt  */
    uint8_t  RX_FIFO_0P5_FULL_MASK:1;   /**< bit:      2  Active High Enable of rx_fifo_0p5_full interrupt  */
    uint8_t  RX_FIFO_0P75_FULL_MASK:1;  /**< bit:      3  Active High Enable of rx_fifo_0p75_full interrupt  */
    uint8_t  TIMEOUT_MASK:1;            /**< bit:      4  Active High Enable of timeout interrupt  */
    uint8_t  PARITY_ERROR_MASK:1;       /**< bit:      5  Active High Enable of parity error interrupt  */
    uint8_t  FIFO_OVERRUN_MASK:1;       /**< bit:      6  Active High Enable of FIFO overrun interrupt  */
    uint8_t  FRAMING_ERROR_MASK:1;      /**< bit:      7  Active High Enable of framing error interrupt  */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} UART_RX_INTERRUPT_MASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_RX_INTERRUPT_MASK_OFFSET       0x18                                          /**<  (UART_RX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the rx_status register.   Offset */
#define UART_RX_INTERRUPT_MASK_RESETVALUE   0x00u                                         /**<  (UART_RX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the rx_status register.   Reset Value */

#define UART_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Pos 0                                              /**< (UART_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_not_empty interrupt  Position */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Msk (0x1u << UART_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Pos)  /**< (UART_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_not_empty interrupt  Mask */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK UART_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Msk instead */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Pos 1                                              /**< (UART_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p25_full interrupt  Position */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Msk (0x1u << UART_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Pos)  /**< (UART_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p25_full interrupt  Mask */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK UART_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Msk instead */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Pos 2                                              /**< (UART_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p5_full interrupt  Position */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Msk (0x1u << UART_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Pos)  /**< (UART_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p5_full interrupt  Mask */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK UART_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Msk instead */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Pos 3                                              /**< (UART_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p75_full interrupt  Position */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Msk (0x1u << UART_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Pos)  /**< (UART_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p75_full interrupt  Mask */
#define UART_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK UART_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Msk instead */
#define UART_RX_INTERRUPT_MASK_TIMEOUT_MASK_Pos 4                                              /**< (UART_RX_INTERRUPT_MASK) Active High Enable of timeout interrupt  Position */
#define UART_RX_INTERRUPT_MASK_TIMEOUT_MASK_Msk (0x1u << UART_RX_INTERRUPT_MASK_TIMEOUT_MASK_Pos)  /**< (UART_RX_INTERRUPT_MASK) Active High Enable of timeout interrupt  Mask */
#define UART_RX_INTERRUPT_MASK_TIMEOUT_MASK UART_RX_INTERRUPT_MASK_TIMEOUT_MASK_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RX_INTERRUPT_MASK_TIMEOUT_MASK_Msk instead */
#define UART_RX_INTERRUPT_MASK_PARITY_ERROR_MASK_Pos 5                                              /**< (UART_RX_INTERRUPT_MASK) Active High Enable of parity error interrupt  Position */
#define UART_RX_INTERRUPT_MASK_PARITY_ERROR_MASK_Msk (0x1u << UART_RX_INTERRUPT_MASK_PARITY_ERROR_MASK_Pos)  /**< (UART_RX_INTERRUPT_MASK) Active High Enable of parity error interrupt  Mask */
#define UART_RX_INTERRUPT_MASK_PARITY_ERROR_MASK UART_RX_INTERRUPT_MASK_PARITY_ERROR_MASK_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RX_INTERRUPT_MASK_PARITY_ERROR_MASK_Msk instead */
#define UART_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Pos 6                                              /**< (UART_RX_INTERRUPT_MASK) Active High Enable of FIFO overrun interrupt  Position */
#define UART_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Msk (0x1u << UART_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Pos)  /**< (UART_RX_INTERRUPT_MASK) Active High Enable of FIFO overrun interrupt  Mask */
#define UART_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK UART_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Msk instead */
#define UART_RX_INTERRUPT_MASK_FRAMING_ERROR_MASK_Pos 7                                              /**< (UART_RX_INTERRUPT_MASK) Active High Enable of framing error interrupt  Position */
#define UART_RX_INTERRUPT_MASK_FRAMING_ERROR_MASK_Msk (0x1u << UART_RX_INTERRUPT_MASK_FRAMING_ERROR_MASK_Pos)  /**< (UART_RX_INTERRUPT_MASK) Active High Enable of framing error interrupt  Mask */
#define UART_RX_INTERRUPT_MASK_FRAMING_ERROR_MASK UART_RX_INTERRUPT_MASK_FRAMING_ERROR_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_RX_INTERRUPT_MASK_FRAMING_ERROR_MASK_Msk instead */
#define UART_RX_INTERRUPT_MASK_Msk          0xFFu                                          /**< (UART_RX_INTERRUPT_MASK) Register Mask  */

/* -------- UART_RECEIVE_TIMEOUT : (UART Offset: 0x1c) (R/W 8) Timeout counter configuration.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMEOUT_VALUE:8;           /**< bit:   0..7  Timeout counter reload value, after status register is read or character received.  Counter decrements at baud rate clock.  */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} UART_RECEIVE_TIMEOUT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_RECEIVE_TIMEOUT_OFFSET         0x1C                                          /**<  (UART_RECEIVE_TIMEOUT) Timeout counter configuration.   Offset */
#define UART_RECEIVE_TIMEOUT_RESETVALUE     0x00u                                         /**<  (UART_RECEIVE_TIMEOUT) Timeout counter configuration.   Reset Value */

