remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/uart.h
#define UART_RECEIVE_TIMEOUT_TIMEOUT_VALUE_Pos 0                                              /**< (UART_RECEIVE_TIMEOUT) Timeout counter reload value, after status register is read or character received.  Counter decrements at baud rate clock.  Position */
#define UART_RECEIVE_TIMEOUT_TIMEOUT_VALUE_Msk (0xFFu << UART_RECEIVE_TIMEOUT_TIMEOUT_VALUE_Pos)  /**< (UART_RECEIVE_TIMEOUT) Timeout counter reload value, after status register is read or character received.  Counter decrements at baud rate clock.  Mask */
#define UART_RECEIVE_TIMEOUT_TIMEOUT_VALUE(value) (UART_RECEIVE_TIMEOUT_TIMEOUT_VALUE_Msk & ((value) << UART_RECEIVE_TIMEOUT_TIMEOUT_VALUE_Pos))
#define UART_RECEIVE_TIMEOUT_MASK           0xFFu                                          /**< \deprecated (UART_RECEIVE_TIMEOUT) Register MASK  (Use UART_RECEIVE_TIMEOUT_Msk instead)  */
#define UART_RECEIVE_TIMEOUT_Msk            0xFFu                                          /**< (UART_RECEIVE_TIMEOUT) Register Mask  */

/* -------- UART_CONFIGURATION : (UART Offset: 0x20) (R/W 8) UART Operation Configuration Register, for both Rx and Tx.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  NUMBER_OF_BITS:1;          /**< bit:      0  Number of bits per character, not including parity */
    uint8_t  PARITY_ENABLE:1;           /**< bit:      1  Active High parity checking and generation enable */
    uint8_t  PARITY_MODE:2;             /**< bit:   2..3  Parity Mode Select                       */
    uint8_t  STOP_BITS:1;               /**< bit:      4  Number of stop bits                      */
    uint8_t  CTS_ENABLE:1;              /**< bit:      5  Active High Flow Control Enable. When enabled, transmission starts when cts signal is asserted */
    uint8_t  :2;                        /**< bit:   6..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} UART_CONFIGURATION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_CONFIGURATION_OFFSET           0x20                                          /**<  (UART_CONFIGURATION) UART Operation Configuration Register, for both Rx and Tx.   Offset */
#define UART_CONFIGURATION_RESETVALUE       0x00u                                         /**<  (UART_CONFIGURATION) UART Operation Configuration Register, for both Rx and Tx.   Reset Value */

#define UART_CONFIGURATION_NUMBER_OF_BITS_Pos 0                                              /**< (UART_CONFIGURATION) Number of bits per character, not including parity Position */
#define UART_CONFIGURATION_NUMBER_OF_BITS_Msk (0x1u << UART_CONFIGURATION_NUMBER_OF_BITS_Pos)  /**< (UART_CONFIGURATION) Number of bits per character, not including parity Mask */
#define UART_CONFIGURATION_NUMBER_OF_BITS   UART_CONFIGURATION_NUMBER_OF_BITS_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_CONFIGURATION_NUMBER_OF_BITS_Msk instead */
#define   UART_CONFIGURATION_NUMBER_OF_BITS_0_Val 0x0u                                           /**< (UART_CONFIGURATION) 8 bits  */
#define   UART_CONFIGURATION_NUMBER_OF_BITS_1_Val 0x1u                                           /**< (UART_CONFIGURATION) 7 bits  */
#define UART_CONFIGURATION_NUMBER_OF_BITS_0 (UART_CONFIGURATION_NUMBER_OF_BITS_0_Val << UART_CONFIGURATION_NUMBER_OF_BITS_Pos)  /**< (UART_CONFIGURATION) 8 bits Position  */
#define UART_CONFIGURATION_NUMBER_OF_BITS_1 (UART_CONFIGURATION_NUMBER_OF_BITS_1_Val << UART_CONFIGURATION_NUMBER_OF_BITS_Pos)  /**< (UART_CONFIGURATION) 7 bits Position  */
#define UART_CONFIGURATION_PARITY_ENABLE_Pos 1                                              /**< (UART_CONFIGURATION) Active High parity checking and generation enable Position */
#define UART_CONFIGURATION_PARITY_ENABLE_Msk (0x1u << UART_CONFIGURATION_PARITY_ENABLE_Pos)  /**< (UART_CONFIGURATION) Active High parity checking and generation enable Mask */
#define UART_CONFIGURATION_PARITY_ENABLE    UART_CONFIGURATION_PARITY_ENABLE_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_CONFIGURATION_PARITY_ENABLE_Msk instead */
#define   UART_CONFIGURATION_PARITY_ENABLE_0_Val 0x0u                                           /**< (UART_CONFIGURATION) Disable  */
#define   UART_CONFIGURATION_PARITY_ENABLE_1_Val 0x1u                                           /**< (UART_CONFIGURATION) Enable  */
#define UART_CONFIGURATION_PARITY_ENABLE_0  (UART_CONFIGURATION_PARITY_ENABLE_0_Val << UART_CONFIGURATION_PARITY_ENABLE_Pos)  /**< (UART_CONFIGURATION) Disable Position  */
#define UART_CONFIGURATION_PARITY_ENABLE_1  (UART_CONFIGURATION_PARITY_ENABLE_1_Val << UART_CONFIGURATION_PARITY_ENABLE_Pos)  /**< (UART_CONFIGURATION) Enable Position  */
#define UART_CONFIGURATION_PARITY_MODE_Pos  2                                              /**< (UART_CONFIGURATION) Parity Mode Select Position */
#define UART_CONFIGURATION_PARITY_MODE_Msk  (0x3u << UART_CONFIGURATION_PARITY_MODE_Pos)   /**< (UART_CONFIGURATION) Parity Mode Select Mask */
#define UART_CONFIGURATION_PARITY_MODE(value) (UART_CONFIGURATION_PARITY_MODE_Msk & ((value) << UART_CONFIGURATION_PARITY_MODE_Pos))
#define   UART_CONFIGURATION_PARITY_MODE_0_Val 0x0u                                           /**< (UART_CONFIGURATION) Even Parity  */
#define   UART_CONFIGURATION_PARITY_MODE_1_Val 0x1u                                           /**< (UART_CONFIGURATION) Odd Parity  */
#define   UART_CONFIGURATION_PARITY_MODE_2_Val 0x2u                                           /**< (UART_CONFIGURATION) Parity bit is space  */
#define   UART_CONFIGURATION_PARITY_MODE_3_Val 0x3u                                           /**< (UART_CONFIGURATION) Parity bit is mark  */
#define UART_CONFIGURATION_PARITY_MODE_0    (UART_CONFIGURATION_PARITY_MODE_0_Val << UART_CONFIGURATION_PARITY_MODE_Pos)  /**< (UART_CONFIGURATION) Even Parity Position  */
#define UART_CONFIGURATION_PARITY_MODE_1    (UART_CONFIGURATION_PARITY_MODE_1_Val << UART_CONFIGURATION_PARITY_MODE_Pos)  /**< (UART_CONFIGURATION) Odd Parity Position  */
#define UART_CONFIGURATION_PARITY_MODE_2    (UART_CONFIGURATION_PARITY_MODE_2_Val << UART_CONFIGURATION_PARITY_MODE_Pos)  /**< (UART_CONFIGURATION) Parity bit is space Position  */
#define UART_CONFIGURATION_PARITY_MODE_3    (UART_CONFIGURATION_PARITY_MODE_3_Val << UART_CONFIGURATION_PARITY_MODE_Pos)  /**< (UART_CONFIGURATION) Parity bit is mark Position  */
#define UART_CONFIGURATION_STOP_BITS_Pos    4                                              /**< (UART_CONFIGURATION) Number of stop bits Position */
#define UART_CONFIGURATION_STOP_BITS_Msk    (0x1u << UART_CONFIGURATION_STOP_BITS_Pos)     /**< (UART_CONFIGURATION) Number of stop bits Mask */
#define UART_CONFIGURATION_STOP_BITS        UART_CONFIGURATION_STOP_BITS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_CONFIGURATION_STOP_BITS_Msk instead */
#define   UART_CONFIGURATION_STOP_BITS_0_Val 0x0u                                           /**< (UART_CONFIGURATION) One Bit  */
#define   UART_CONFIGURATION_STOP_BITS_1_Val 0x1u                                           /**< (UART_CONFIGURATION) Two Bits  */
#define UART_CONFIGURATION_STOP_BITS_0      (UART_CONFIGURATION_STOP_BITS_0_Val << UART_CONFIGURATION_STOP_BITS_Pos)  /**< (UART_CONFIGURATION) One Bit Position  */
#define UART_CONFIGURATION_STOP_BITS_1      (UART_CONFIGURATION_STOP_BITS_1_Val << UART_CONFIGURATION_STOP_BITS_Pos)  /**< (UART_CONFIGURATION) Two Bits Position  */
#define UART_CONFIGURATION_CTS_ENABLE_Pos   5                                              /**< (UART_CONFIGURATION) Active High Flow Control Enable. When enabled, transmission starts when cts signal is asserted Position */
#define UART_CONFIGURATION_CTS_ENABLE_Msk   (0x1u << UART_CONFIGURATION_CTS_ENABLE_Pos)    /**< (UART_CONFIGURATION) Active High Flow Control Enable. When enabled, transmission starts when cts signal is asserted Mask */
#define UART_CONFIGURATION_CTS_ENABLE       UART_CONFIGURATION_CTS_ENABLE_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_CONFIGURATION_CTS_ENABLE_Msk instead */
#define   UART_CONFIGURATION_CTS_ENABLE_0_Val 0x0u                                           /**< (UART_CONFIGURATION) Disable-Transmission starts only when cts signal is asserted  */
#define   UART_CONFIGURATION_CTS_ENABLE_1_Val 0x1u                                           /**< (UART_CONFIGURATION) Enable-Transmission starts regardless of cts signal  */
#define UART_CONFIGURATION_CTS_ENABLE_0     (UART_CONFIGURATION_CTS_ENABLE_0_Val << UART_CONFIGURATION_CTS_ENABLE_Pos)  /**< (UART_CONFIGURATION) Disable-Transmission starts only when cts signal is asserted Position  */
#define UART_CONFIGURATION_CTS_ENABLE_1     (UART_CONFIGURATION_CTS_ENABLE_1_Val << UART_CONFIGURATION_CTS_ENABLE_Pos)  /**< (UART_CONFIGURATION) Enable-Transmission starts regardless of cts signal Position  */
#define UART_CONFIGURATION_MASK             0x3Fu                                          /**< \deprecated (UART_CONFIGURATION) Register MASK  (Use UART_CONFIGURATION_Msk instead)  */
#define UART_CONFIGURATION_Msk              0x3Fu                                          /**< (UART_CONFIGURATION) Register Mask  */

/* -------- UART_BAUD_RATE : (UART Offset: 0x24) (R/W 16) Baud Rate Control Register. Bits 15:3 specify the integral division of the clock (divide by n),  and bit 2:0 specify the fractional division.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t FRACTIONAL_DIVISION:3;     /**< bit:   0..2  Fractional Division Part. If non-zero, the integer part must be at least set to 3.  */
    uint16_t INTEGER_DIVISION:13;       /**< bit:  3..15  Integral Division Part. Must be at least set to 2.  */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} UART_BAUD_RATE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_BAUD_RATE_OFFSET               0x24                                          /**<  (UART_BAUD_RATE) Baud Rate Control Register. Bits 15:3 specify the integral division of the clock (divide by n),  and bit 2:0 specify the fractional division.   Offset */
#define UART_BAUD_RATE_RESETVALUE           0x00u                                         /**<  (UART_BAUD_RATE) Baud Rate Control Register. Bits 15:3 specify the integral division of the clock (divide by n),  and bit 2:0 specify the fractional division.   Reset Value */

#define UART_BAUD_RATE_FRACTIONAL_DIVISION_Pos 0                                              /**< (UART_BAUD_RATE) Fractional Division Part. If non-zero, the integer part must be at least set to 3.  Position */
#define UART_BAUD_RATE_FRACTIONAL_DIVISION_Msk (0x7u << UART_BAUD_RATE_FRACTIONAL_DIVISION_Pos)  /**< (UART_BAUD_RATE) Fractional Division Part. If non-zero, the integer part must be at least set to 3.  Mask */
#define UART_BAUD_RATE_FRACTIONAL_DIVISION(value) (UART_BAUD_RATE_FRACTIONAL_DIVISION_Msk & ((value) << UART_BAUD_RATE_FRACTIONAL_DIVISION_Pos))
#define UART_BAUD_RATE_INTEGER_DIVISION_Pos 3                                              /**< (UART_BAUD_RATE) Integral Division Part. Must be at least set to 2.  Position */
#define UART_BAUD_RATE_INTEGER_DIVISION_Msk (0x1FFFu << UART_BAUD_RATE_INTEGER_DIVISION_Pos)  /**< (UART_BAUD_RATE) Integral Division Part. Must be at least set to 2.  Mask */
#define UART_BAUD_RATE_INTEGER_DIVISION(value) (UART_BAUD_RATE_INTEGER_DIVISION_Msk & ((value) << UART_BAUD_RATE_INTEGER_DIVISION_Pos))
#define UART_BAUD_RATE_MASK                 0xFFFFu                                        /**< \deprecated (UART_BAUD_RATE) Register MASK  (Use UART_BAUD_RATE_Msk instead)  */
#define UART_BAUD_RATE_Msk                  0xFFFFu                                        /**< (UART_BAUD_RATE) Register Mask  */

/* -------- UART_CLOCK_SOURCE : (UART Offset: 0x28) (R/W 8) Selects Source of UART Clock  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CLOCK_SELECT:2;            /**< bit:   0..1  Selects one of the four possible clock sources. */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} UART_CLOCK_SOURCE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_CLOCK_SOURCE_OFFSET            0x28                                          /**<  (UART_CLOCK_SOURCE) Selects Source of UART Clock   Offset */
#define UART_CLOCK_SOURCE_RESETVALUE        0x00u                                         /**<  (UART_CLOCK_SOURCE) Selects Source of UART Clock   Reset Value */

