remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/uart.h
#define UART_CLOCK_SOURCE_CLOCK_SELECT_Pos  0                                              /**< (UART_CLOCK_SOURCE) Selects one of the four possible clock sources. Position */
#define UART_CLOCK_SOURCE_CLOCK_SELECT_Msk  (0x3u << UART_CLOCK_SOURCE_CLOCK_SELECT_Pos)   /**< (UART_CLOCK_SOURCE) Selects one of the four possible clock sources. Mask */
#define UART_CLOCK_SOURCE_CLOCK_SELECT(value) (UART_CLOCK_SOURCE_CLOCK_SELECT_Msk & ((value) << UART_CLOCK_SOURCE_CLOCK_SELECT_Pos))
#define   UART_CLOCK_SOURCE_CLOCK_SELECT_0_Val 0x0u                                           /**< (UART_CLOCK_SOURCE) Clock input 0  */
#define   UART_CLOCK_SOURCE_CLOCK_SELECT_1_Val 0x1u                                           /**< (UART_CLOCK_SOURCE) Clock input 1  */
#define   UART_CLOCK_SOURCE_CLOCK_SELECT_2_Val 0x2u                                           /**< (UART_CLOCK_SOURCE) Clock input 2  */
#define   UART_CLOCK_SOURCE_CLOCK_SELECT_3_Val 0x3u                                           /**< (UART_CLOCK_SOURCE) Clock input 3  */
#define UART_CLOCK_SOURCE_CLOCK_SELECT_0    (UART_CLOCK_SOURCE_CLOCK_SELECT_0_Val << UART_CLOCK_SOURCE_CLOCK_SELECT_Pos)  /**< (UART_CLOCK_SOURCE) Clock input 0 Position  */
#define UART_CLOCK_SOURCE_CLOCK_SELECT_1    (UART_CLOCK_SOURCE_CLOCK_SELECT_1_Val << UART_CLOCK_SOURCE_CLOCK_SELECT_Pos)  /**< (UART_CLOCK_SOURCE) Clock input 1 Position  */
#define UART_CLOCK_SOURCE_CLOCK_SELECT_2    (UART_CLOCK_SOURCE_CLOCK_SELECT_2_Val << UART_CLOCK_SOURCE_CLOCK_SELECT_Pos)  /**< (UART_CLOCK_SOURCE) Clock input 2 Position  */
#define UART_CLOCK_SOURCE_CLOCK_SELECT_3    (UART_CLOCK_SOURCE_CLOCK_SELECT_3_Val << UART_CLOCK_SOURCE_CLOCK_SELECT_Pos)  /**< (UART_CLOCK_SOURCE) Clock input 3 Position  */
#define UART_CLOCK_SOURCE_MASK              0x03u                                          /**< \deprecated (UART_CLOCK_SOURCE) Register MASK  (Use UART_CLOCK_SOURCE_Msk instead)  */
#define UART_CLOCK_SOURCE_Msk               0x03u                                          /**< (UART_CLOCK_SOURCE) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief UART hardware registers */
typedef struct {  /* UART Controller */
  WoReg8  TRANSMIT_DATA;  /**< (UART Offset: 0x00) Writes one byte to UART Transmit Data FIFO.  */
  __I  uint8_t  Reserved1[3];
  RoReg8  TRANSMIT_STATUS; /**< (UART Offset: 0x04) Status of the UART transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.  */
  __I  uint8_t  Reserved2[3];
  RwReg8  TX_INTERRUPT_MASK; /**< (UART Offset: 0x08) Enable or Disable the generation of interrupts by the tx_status register.  */
  __I  uint8_t  Reserved3[7];
  RoReg8  RECEIVE_DATA;   /**< (UART Offset: 0x10) Read one byte from UART Receive Data FIFO.  */
  __I  uint8_t  Reserved4[3];
  RoReg8  RECEIVE_STATUS; /**< (UART Offset: 0x14) Status of the UART receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.  */
  __I  uint8_t  Reserved5[3];
  RwReg8  RX_INTERRUPT_MASK; /**< (UART Offset: 0x18) Enable or Disable the generation of interrupts by the rx_status register.  */
  __I  uint8_t  Reserved6[3];
  RwReg8  RECEIVE_TIMEOUT; /**< (UART Offset: 0x1C) Timeout counter configuration.  */
  __I  uint8_t  Reserved7[3];
  RwReg8  UART_CONFIGURATION; /**< (UART Offset: 0x20) UART Operation Configuration Register, for both Rx and Tx.  */
  __I  uint8_t  Reserved8[3];
  RwReg16 UART_BAUD_RATE; /**< (UART Offset: 0x24) Baud Rate Control Register. Bits 15:3 specify the integral division of the clock (divide by n),  and bit 2:0 specify the fractional division.  */
  __I  uint8_t  Reserved9[2];
  RwReg8  UART_CLOCK_SOURCE; /**< (UART Offset: 0x28) Selects Source of UART Clock  */
} Uart;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief UART hardware registers */
typedef struct {  /* UART Controller */
  __O  UART_TRANSMIT_DATA_Type        TRANSMIT_DATA;  /**< Offset: 0x00 ( /W   8) Writes one byte to UART Transmit Data FIFO.  */
       RoReg8                         Reserved1[0x3];
  __I  UART_TRANSMIT_STATUS_Type      TRANSMIT_STATUS; /**< Offset: 0x04 (R/    8) Status of the UART transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.  */
       RoReg8                         Reserved2[0x3];
  __IO UART_TX_INTERRUPT_MASK_Type    TX_INTERRUPT_MASK; /**< Offset: 0x08 (R/W   8) Enable or Disable the generation of interrupts by the tx_status register.  */
       RoReg8                         Reserved3[0x7];
  __I  UART_RECEIVE_DATA_Type         RECEIVE_DATA;   /**< Offset: 0x10 (R/    8) Read one byte from UART Receive Data FIFO.  */
       RoReg8                         Reserved4[0x3];
  __I  UART_RECEIVE_STATUS_Type       RECEIVE_STATUS; /**< Offset: 0x14 (R/    8) Status of the UART receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.  */
       RoReg8                         Reserved5[0x3];
  __IO UART_RX_INTERRUPT_MASK_Type    RX_INTERRUPT_MASK; /**< Offset: 0x18 (R/W   8) Enable or Disable the generation of interrupts by the rx_status register.  */
       RoReg8                         Reserved6[0x3];
  __IO UART_RECEIVE_TIMEOUT_Type      RECEIVE_TIMEOUT; /**< Offset: 0x1C (R/W   8) Timeout counter configuration.  */
       RoReg8                         Reserved7[0x3];
  __IO UART_CONFIGURATION_Type        UART_CONFIGURATION; /**< Offset: 0x20 (R/W   8) UART Operation Configuration Register, for both Rx and Tx.  */
       RoReg8                         Reserved8[0x3];
  __IO UART_BAUD_RATE_Type            UART_BAUD_RATE; /**< Offset: 0x24 (R/W  16) Baud Rate Control Register. Bits 15:3 specify the integral division of the clock (divide by n),  and bit 2:0 specify the fractional division.  */
       RoReg8                         Reserved9[0x2];
  __IO UART_CLOCK_SOURCE_Type         UART_CLOCK_SOURCE; /**< Offset: 0x28 (R/W   8) Selects Source of UART Clock  */
} Uart;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_UART_COMPONENT_ */
